0.1.0/tutorials/incompressible/piso/ras/cavity_coupled_u/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00325;

boundaryField
{
  movingWall
  {
    type            kqRWallFunction;
    value           uniform 0.00325;
  }
  fixedWalls
  {
    type            kqRWallFunction;
    value           uniform 0.00325;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
