0.1.0/tutorials/incompressible/piso/ras/cavity_coupled_u/0/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  movingWall
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  fixedWalls
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
